//
//  DataBase.swift
//  MyHabits
//
//  Created by Алексей Потемин on 25.09.2022.
//

import Foundation

var textInfoHabits: [ModelInfo] = [info1, info2, info3, info4, info5, info6, info7]
                                   
let info1 = ModelInfo(text: "Прохождение этапов, за которые за 21 день вырабатывается привычка, подчиняется следующему алгоритму:")
let info2 = ModelInfo(text: "1. Провести 1 день без обращения к старым привычкам, стараться вести себя так, как будто цель, загаданная в перспективу, находится на расстоянии шага.")
let info3 = ModelInfo(text: "2. Выдержать 2 дня в прежнем состоянии самоконтроля.")
let info4 = ModelInfo(text: "3. Отметить в дневнике первую неделю изменений и подвести первые итоги — что оказалось тяжело, что — легче, с чем еще предстоит серьезно бороться.")
let info5 = ModelInfo(text: "4. Поздравить себя с прохождением первого серьезного порога в 21 день. За это время отказ от дурных наклонностей уже примет форму осознанного преодоления и человек сможет больше работать в сторону принятия положительных качеств.")
let info6 = ModelInfo(text: "5. Держать планку 40 дней. Практикующий методику уже чувствует себя освободившимся от прошлого негатива и двигается в нужном направлении с хорошей динамикой.")
let info7 = ModelInfo(text: "6. На 90-й день соблюдения техники все лишнее из «прошлой жизни» перестает напоминать о себе, и человек, оглянувшись назад, осознает себя полностью обновившимся.")

 
